In [3]:
import pandas as pd
import numpy as np
from matplotlib import pyplot as plt
%matplotlib inline
import matplotlib 
matplotlib.rcParams["figure.figsize"] = (20,10)

In [4]:
df1 = pd.read_csv("Toronto_apartment.csv")
df1.head()

,Bedroom,Bathroom,Den,Address,Lat,Long,Price
0,2,2.0,0,"3985 Grand Park Drive, 3985 Grand Park Dr, Mis...",43.581639,-79.648193,"$2,450.00"
1,1,1.0,1,"361 Front St W, Toronto, ON M5V 3R5, Canada",43.643051,-79.391643,"$2,150.00"
2,1,1.0,0,"89 McGill Street, Toronto, ON, M5B 0B1",43.660605,-79.378635,"$1,950.00"
3,2,2.0,0,"10 York Street, Toronto, ON, M5J 0E1",43.641087,-79.381405,"$2,900.00"
4,1,1.0,0,"80 St Patrick St, Toronto, ON M5T 2X6, Canada",43.652487,-79.389622,"$1,800.00"

In [5]:
df1.shape

(1124, 7)

In [6]:
df1['Address'].value_counts()

10 York Street, Toronto, ON, M5J 0E1                                          17
70 Temperance St, Toronto, ON M5H 0B1, Canada                                 15
3985 Grand Park Drive, 3985 Grand Park Dr, Mississauga, ON L5B 0H8, Canada    13
89 McGill Street, Toronto, ON, M5B 0B1                                        12
87 Peter St, Toronto, ON M5V 0P1, Canada                                      11
                                                                              ..
23 Wyndham St, Toronto, ON M6K 1R8, Canada                                     1
39 Upper Duke Crescent, Unionville, ON L6G 0B8, Canada                         1
350 Wellington St W, Toronto, ON M5V 3W9, Canada                               1
20 King St E, Cobourg, ON K9A 1K7, Canada                                      1
561 Sherbourne St, Toronto, ON M4X 0A1, Canada                                 1
Name: Address, Length: 653, dtype: int64

In [7]:
df2 = df1.drop(['Lat', 'Long'], axis = 'columns')
df2.shape

(1124, 5)

In [8]:
df2.head()

,Bedroom,Bathroom,Den,Address,Price
0,2,2.0,0,"3985 Grand Park Drive, 3985 Grand Park Dr, Mis...","$2,450.00"
1,1,1.0,1,"361 Front St W, Toronto, ON M5V 3R5, Canada","$2,150.00"
2,1,1.0,0,"89 McGill Street, Toronto, ON, M5B 0B1","$1,950.00"
3,2,2.0,0,"10 York Street, Toronto, ON, M5J 0E1","$2,900.00"
4,1,1.0,0,"80 St Patrick St, Toronto, ON M5T 2X6, Canada","$1,800.00"

In [33]:
df2.head()

0    2,450.00
1    2,150.00
2    1,950.00
3    2,900.00
4    1,800.00
Name: Price, dtype: object

In [14]:
def is_float(x):
    try:
        float(x)
    except:
        return False
    return True

In [26]:
df2.Price.str.replace('$', '')

C:\Users\HP\AppData\Local\Temp/ipykernel_5400/2439095737.py:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  df2.Price.str.replace('$', '')

0       2,450.00
1       2,150.00
2       1,950.00
3       2,900.00
4       1,800.00
          ...
1119    3,000.00
1120    1,200.00
1121    1,800.00
1122    2,200.00
1123    2,150.00
Name: Price, Length: 1124, dtype: object

In [32]:
df2.head()

0    2,450.00
1    2,150.00
2    1,950.00
3    2,900.00
4    1,800.00
Name: Price, dtype: object

In [31]:
df2.head()

0    2,450.00
1    2,150.00
2    1,950.00
3    2,900.00
4    1,800.00
Name: Price, dtype: object